Revit 2027 API
ExporterIFC.RegisterSpaceBoundingElementHandle Method
 Stores a handle representing a space bounding element to the ExporterIFC's internal cache.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RegisterSpaceBoundingElementHandle(
	IFCAnyHandle instanceHandle,
	ElementId id,
	ElementId levelId
)
Public Sub RegisterSpaceBoundingElementHandle (
	instanceHandle As IFCAnyHandle,
	id As ElementId,
	levelId As ElementId
)
public:
void RegisterSpaceBoundingElementHandle(
	IFCAnyHandle^ instanceHandle,
	ElementId^ id,
	ElementId^ levelId
)
member RegisterSpaceBoundingElementHandle :
        instanceHandle : IFCAnyHandle *
        id : ElementId *
        levelId : ElementId -> unit
Parameters
instanceHandle IFCAnyHandle
 The handle to the space bounding element.
id ElementId
 The Revit element id associated to this handle.
levelId ElementId
 The level id assigned to the space bounding object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The cache of space bounding elements will be used during completion of export to create relationship objects such as IfcRelSpaceBoundary and IfcRelConnectsPathElements. The types of Revit elements accepted by this function are:
Walls
Curtain walls
Roofs
Floors
Doors
Windows
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace